In [2]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('StudentsPerformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## groupby which is used to group by non aggregated columns 
## based on group by we can perform aggregation functions ex: min,max,mean,sum

In [19]:
groups_values = df.groupby('gender')

In [20]:
groups_values

In [21]:
res = groups_values.groups # groups is a varaiable which returns dictionary and it keeps values as unique values

In [22]:
res.keys()

dict_keys(['female', 'male'])

In [23]:
res['female']

Index([  0,   1,   2,   5,   6,   9,  12,  14,  15,  17,
       ...
       986, 988, 989, 991, 992, 993, 995, 997, 998, 999],
      dtype='int64', length=518)

In [24]:
res['male']

Index([  3,   4,   7,   8,  10,  11,  13,  16,  18,  20,
       ...
       976, 977, 978, 981, 982, 985, 987, 990, 994, 996],
      dtype='int64', length=482)

## dataframe.get_group()

## get_groups is used to extract particular grouped records
### it is case sensitive

In [25]:
groups_values.get_group('female')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## male ------|group A |
##            |group B | --- count
##            |group C |

## female ------|group A |
##              |group B | --- count
##              |group C |

In [ ]:
grouped_column = df.groupby('gender')

In [48]:
male = grouped_column.get_group('male')
female = grouped_column.get_group('female')

In [51]:
male['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     53
group E     71
group B     86
group D    133
group C    139
Name: count, dtype: int64

In [52]:
female['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     36
group E     69
group B    104
group D    129
group C    180
Name: count, dtype: int64

In [54]:
df.groupby('gender')['race/ethnicity'].value_counts(ascending=True)

gender  race/ethnicity
female  group A            36
        group E            69
        group B           104
        group D           129
        group C           180
male    group A            53
        group E            71
        group B            86
        group D           133
        group C           139
Name: count, dtype: int64

In [55]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [70]:
g_c = df.groupby('gender')['writing score'].mean()
g_c

gender
female    72.467181
male      63.311203
Name: writing score, dtype: float64

## get the group A along with associate degree of male

In [81]:
df['gender'] = 'male'
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,72,72,74
1,male,group C,some college,standard,completed,69,90,88
2,male,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,male,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,male,group C,high school,free/reduced,completed,59,71,65
998,male,group D,some college,standard,completed,68,78,77
999,male,group D,some college,free/reduced,none,77,86,86

In [ ]:
df.query('(gender == "male") & (`race/ethnicity` == "group A") & (`parental level of education` == "associate\'s degree")')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [99]:
df[(df['gender'] == 'male') & (df['race/ethnicity'] == "group A") & (df['parental level of education'] == "associate's degree")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [ ]:
gv = groups.groupby(['gender','race/ethnicity','parental level of education'])
gv.get_group(('male','group A','associate\'s degree'))

## reset_index()

In [14]:
filter = df.groupby('gender').get_group('male')
filter.reset_index(inplace=True)

In [15]:
filter

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,3,male,group A,associate's degree,free/reduced,none,47,57,44
1,4,male,group C,some college,standard,none,76,78,75
2,7,male,group B,some college,free/reduced,none,40,43,39
3,8,male,group D,high school,free/reduced,completed,64,64,67
4,10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...,...
477,985,male,group A,high school,standard,none,57,51,54
478,987,male,group E,some high school,standard,completed,81,75,76
479,990,male,group E,high school,free/reduced,completed,86,81,75
480,994,male,group A,high school,standard,none,63,63,62
481,996,male,group C,high school,free/reduced,none,62,55,55

In [18]:
filter.drop(['index'],axis=1) # here inplace=True doesn't return table

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,associate's degree,free/reduced,none,47,57,44
1,male,group C,some college,standard,none,76,78,75
2,male,group B,some college,free/reduced,none,40,43,39
3,male,group D,high school,free/reduced,completed,64,64,67
4,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
477,male,group A,high school,standard,none,57,51,54
478,male,group E,some high school,standard,completed,81,75,76
479,male,group E,high school,free/reduced,completed,86,81,75
480,male,group A,high school,standard,none,63,63,62
481,male,group C,high school,free/reduced,none,62,55,55

In [5]:
filter = df.groupby('gender').get_group('male')
filter.reset_index(inplace=True,drop=True) # drop = True removes the index if it is false it keeps

In [6]:
filter.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,associate's degree,free/reduced,none,47,57,44
1,male,group C,some college,standard,none,76,78,75
2,male,group B,some college,free/reduced,none,40,43,39
3,male,group D,high school,free/reduced,completed,64,64,67
4,male,group C,associate's degree,standard,none,58,54,52
5,male,group D,associate's degree,standard,none,40,52,43
6,male,group A,some college,standard,completed,78,72,70
7,male,group C,high school,standard,none,88,89,86
8,male,group C,master's degree,free/reduced,completed,46,42,46
9,male,group D,high school,standard,none,66,69,63

In [16]:
df1 = pd.DataFrame({'SRH':['Abhishek Sharma','Travis Head','Pat Cummins','Henrich Klassen','Ishan Kishan'],
                   'CSK':['MS Dhoni','Albie Morkel','Suresh Raina','Ravindra Jadeja','DJ Bravo']})
df1

               SRH              CSK
0  Abhishek Sharma         MS Dhoni
1      Travis Head     Albie Morkel
2      Pat Cummins     Suresh Raina
3  Henrich Klassen  Ravindra Jadeja
4     Ishan Kishan         DJ Bravo

In [19]:
df2 = pd.DataFrame({'SRH':['David Warner','Kane Williamson','Bhuvenshwar Kumar','Rashid Khan','Shikwar Dhawan'],
                   'HDC':['Adam Gilchrist','Andrew Simons','Rohit Sharma','RP Singh','H Gibbs']})
df2

                 SRH             HDC
0       David Warner  Adam Gilchrist
1    Kane Williamson   Andrew Simons
2  Bhuvenshwar Kumar    Rohit Sharma
3        Rashid Khan        RP Singh
4     Shikwar Dhawan         H Gibbs

In [42]:
df3 = pd.DataFrame({'SRH':['David Warner','Kane Williamson','Bhuvenshwar Kumar','Rashid Khan','Shikwar Dhawan'],
                   'MI':['Rohit Sharma','Lasit Malinga','Kieren Pollard','Hardik Pandya','Jasprit Bumra']})
df3

                 SRH              MI
0       David Warner    Rohit Sharma
1    Kane Williamson   Lasit Malinga
2  Bhuvenshwar Kumar  Kieren Pollard
3        Rashid Khan   Hardik Pandya
4     Shikwar Dhawan   Jasprit Bumra

In [29]:
pd.concat([df1,df2]) # by default axis = 0 so it adds row wise means downwards

                 SRH              CSK             HDC
0    Abhishek Sharma         MS Dhoni             NaN
1        Travis Head     Albie Morkel             NaN
2        Pat Cummins     Suresh Raina             NaN
3    Henrich Klassen  Ravindra Jadeja             NaN
4       Ishan Kishan         DJ Bravo             NaN
0       David Warner              NaN  Adam Gilchrist
1    Kane Williamson              NaN   Andrew Simons
2  Bhuvenshwar Kumar              NaN    Rohit Sharma
3        Rashid Khan              NaN        RP Singh
4     Shikwar Dhawan              NaN         H Gibbs

In [51]:
pd.concat([df1,df3],join='inner',axis=0,ignore_index=True) # works with only axis = 0

                 SRH
0    Abhishek Sharma
1        Travis Head
2        Pat Cummins
3    Henrich Klassen
4       Ishan Kishan
5       David Warner
6    Kane Williamson
7  Bhuvenshwar Kumar
8        Rashid Khan
9     Shikwar Dhawan

In [53]:
pd.concat([df1,df3],join='inner',axis=1)

               SRH              CSK                SRH              MI
0  Abhishek Sharma         MS Dhoni       David Warner    Rohit Sharma
1      Travis Head     Albie Morkel    Kane Williamson   Lasit Malinga
2      Pat Cummins     Suresh Raina  Bhuvenshwar Kumar  Kieren Pollard
3  Henrich Klassen  Ravindra Jadeja        Rashid Khan   Hardik Pandya
4     Ishan Kishan         DJ Bravo     Shikwar Dhawan   Jasprit Bumra

In [60]:
male = df.groupby('gender').get_group('male')
female = df.groupby('gender').get_group('female')

In [68]:
new_df = pd.concat([male,female],keys = ['male','female'])
# new_df.index
new_df

            gender race/ethnicity parental level of education         lunch  \
male   3      male        group A          associate's degree  free/reduced
       4      male        group C                some college      standard
       7      male        group B                some college  free/reduced
       8      male        group D                 high school  free/reduced
       10     male        group C          associate's degree      standard
...            ...            ...                         ...           ...
female 993  female        group D           bachelor's degree  free/reduced
       995  female        group E             master's degree      standard
       997  female        group C                 high school  free/reduced
       998  female        group D                some college      standard
       999  female        group D                some college  free/reduced

           test preparation course  math score  reading score  writing score
male   3                      none          47             57             44
       4                      none          76             78             75
       7                      none          40             43             39
       8                 completed          64             64             67
       10                     none          58             54             52
...                            ...         ...            ...            ...
female 993                    none          62             72             74
       995               completed          88             99             95
       997               completed          59             71             65
       998               completed          68             78             77
       999                    none          77             86             86

[1000 rows x 8 columns]

In [3]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
# Filter students who:

# belong to race/ethnicity groups A, B, or C,

# have math score between 70 and 90,

# AND did not complete the test preparation course.
# filtered_df = df[(df['race/ethnicity'].isin(['group A', 'group B', 'group C'])) &
#                  (df['math score'].between(70, 90)) &
#                  (df['test preparation course'] == 'none')]
# filtered_df

In [12]:
df.query('`race/ethnicity` == ["group A", "group B", "group C"] & `math score` >= 70 & `math score` <= 90 & `test preparation course` == "none"')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_level
0,female,group B,bachelor's degree,standard,none,72,72,74,Medium
2,female,group B,master's degree,standard,none,90,95,93,High
4,male,group C,some college,standard,none,76,78,75,Medium
5,female,group B,associate's degree,standard,none,71,83,78,Medium
16,male,group C,high school,standard,none,88,89,86,High
...,...,...,...,...,...,...,...,...,...
946,male,group B,high school,standard,none,82,82,80,Medium
956,male,group C,some college,standard,none,84,87,81,Medium
959,male,group C,high school,standard,none,75,81,71,Medium
969,female,group B,bachelor's degree,standard,none,75,84,80,Medium
984,female,group C,some high school,standard,none,74,75,82,Medium

In [15]:
# Create a new column math_level:

# High: ≥ 85

# Medium: 60–84

# Low: < 60

# Then group by math_level and calculate the mean of all three scores.

In [14]:
def grade_cal(r):
    if r['math score']>85:
        return 'High'
    elif 60<r['math score']<84:
        return 'Medium'
    elif r['math score']<60:
        return 'Low'
    
df['math_level']=df.apply(grade_cal,axis = 1)
mean = df.groupby('math_level')[['math score', 'reading score', 'writing score']].mean()
mean

            math score  reading score  writing score
math_level
High         91.320388      88.320388      86.932039
Low          49.157895      55.613003      54.210526
Medium       70.789869      73.148218      72.213884

In [5]:
df['math_level'] = pd.cut(
    df['math score'],
    bins=[-1, 59, 84, 100],
    labels=['Low', 'Medium', 'High']
)

In [ ]:
math_level_mean = df.groupby('math_level')[['math score', 'reading score', 'writing score']].mean()
math_level_mean

C:\Users\VarunAakash\AppData\Local\Temp\ipykernel_7324\2257075741.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  math_level_mean = df.groupby('math_level')[['math score', 'reading score', 'writing score']].mean()

            math score  reading score  writing score
math_level
Low          49.157895      55.613003      54.210526
Medium       70.741071      73.078571      72.132143
High         90.564103      87.880342      86.752137

In [16]:
# Group students by gender and parental level of education, and compute:

# mean, max, min math score

# standard deviation of writing score

# count of students per group

In [ ]:
group_stats1 = df.groupby(['gender', 'parental level of education'])
m = group_stats1['math score'].mean()
m1 = group_stats1['math score'].max()
m2 = group_stats1['math score'].min()
s = group_stats1['writing score'].std()
c = group_stats1['gender'].count()
new = [m,m1,m2,s,c,]
new

[gender  parental level of education
 female  associate's degree             65.250000
         bachelor's degree              68.349206
         high school                    59.351064
         master's degree                66.500000
         some college                   65.406780
         some high school               59.296703
 male    associate's degree             70.764151
         bachelor's degree              70.581818
         high school                    64.705882
         master's degree                74.826087
         some college                   69.009259
         some high school               67.840909
 Name: math score, dtype: float64,
 gender  parental level of education
 female  associate's degree             100
         bachelor's degree              100
         high school                     99
         master's degree                 94
         some college                   100
         some high school                97
 male    associate's degree             100
         bachelor's degree              100
         high school                     94
         master's degree                 95
         some college                   100
         some high school                94
 Name: math score, dtype: int64,
 gender  parental level of education
 female  associate's degree             26
         bachelor's degree              29
         high school                     8
         master's degree                40
         some college                   19
         some high school                0
 male    associate's degree             40
         bachelor's degree              37
         high school                    27
         master's degree                46
         some college                   28
         some high school               30
 Name: math score, dtype: int64,
 gender  parental level of education
 female  associate's degree             13.307076
         bachelor's degree              13.750576
         high school                    14.378917
         master's degree                14.558557
         some college                   13.343488
         some high school               16.965511
 male    associate's degree             14.077187
         bachelor's degree              13.796428
         high school                    12.669189
         master's degree                11.987642
         some college                   14.716521
         some high school               13.576782
 Name: writing score, dtype: float64,
 gender  parental level of education
 female  associate's degree             116
         bachelor's degree               63
         high school                     94
         master's degree                 36
         some college                   118
         some high school                91
 male    associate's degree             106
         bachelor's degree               55
         high school                    102
         master's degree                 23
         some college                   108
         some high school                88
 Name: gender, dtype: int64]

In [18]:
group_stats = df.groupby(['gender', 'parental level of education']).agg({
    'math score': ['mean', 'max', 'min'],
    'writing score': 'std',
    'gender': 'count'
}).rename(columns={'count': 'student_count'})
group_stats

                                   math score          writing score  \
                                         mean  max min           std
gender parental level of education
female associate's degree           65.250000  100  26     13.307076
       bachelor's degree            68.349206  100  29     13.750576
       high school                  59.351064   99   8     14.378917
       master's degree              66.500000   94  40     14.558557
       some college                 65.406780  100  19     13.343488
       some high school             59.296703   97   0     16.965511
male   associate's degree           70.764151  100  40     14.077187
       bachelor's degree            70.581818  100  37     13.796428
       high school                  64.705882   94  27     12.669189
       master's degree              74.826087   95  46     11.987642
       some college                 69.009259  100  28     14.716521
       some high school             67.840909   94  30     13.576782

                                          gender
                                   student_count
gender parental level of education
female associate's degree                    116
       bachelor's degree                      63
       high school                            94
       master's degree                        36
       some college                          118
       some high school                       91
male   associate's degree                    106
       bachelor's degree                      55
       high school                           102
       master's degree                        23
       some college                          108
       some high school                       88

In [19]:
# For each race/ethnicity group, find students whose
# math score > (mean + 1.5 × std) of their respective group.

In [49]:
gp = df.groupby('race/ethnicity')
g1 = gp.get_group('group A')
g1[g1['math score']>g1['math score'].mean()+1.5*g1['math score'].std()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_level
539,male,group A,associate's degree,standard,completed,97,92,86,High
546,female,group A,some high school,standard,completed,92,100,97,High
571,male,group A,bachelor's degree,standard,none,91,96,92,High
623,male,group A,some college,standard,completed,100,96,86,High
702,male,group A,bachelor's degree,standard,completed,87,84,87,High
820,female,group A,some high school,standard,completed,85,90,92,None

In [50]:
gp = df.groupby('race/ethnicity')
g2 = gp.get_group('group B')
g2[g2['math score']>g2['math score'].mean()+1.5*g2['math score'].std()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_level
2,female,group B,master's degree,standard,none,90,95,93,High
6,female,group B,some college,standard,completed,88,95,92,High
121,male,group B,associate's degree,standard,completed,91,89,92,High
125,female,group B,high school,standard,none,87,95,86,High
146,male,group B,some high school,standard,none,88,84,75,High
221,male,group B,associate's degree,standard,none,87,85,73,High
274,male,group B,some college,standard,completed,88,85,76,High
288,male,group B,bachelor's degree,free/reduced,none,88,75,76,High
333,male,group B,associate's degree,standard,none,90,78,81,High
474,female,group B,associate's degree,standard,completed,90,90,91,High
501,female,group B,associate's degree,standard,completed,94,87,92,High
551,male,group B,bachelor's degree,free/reduced,completed,87,90,88,High
749,male,group B,some college,standard,completed,87,84,86,High
815,male,group B,some high school,standard,completed,94,86,87,High
855,female,group B,bachelor's degree,standard,none,97,97,96,High
919,male,group B,some college,standard,completed,91,96,91,High

In [47]:
# race_stats = df.groupby('race/ethnicity')['math score'].agg(['mean', 'std'])
# df = df.merge(race_stats, on='race/ethnicity', suffixes=('', '_grp'))

# outliers = df[df['math score'] > df['mean'] + 1.5 * df['std']]
# outliers

In [ ]:
# Group by test preparation course and:

# compute the mean of all 3 scores

# compute the percentage improvement in math scores for students who completed the course vs those who didn’t

In [3]:
prep_means = df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean()
prep_means

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

In [24]:
completed_mean = prep_means.loc['completed', 'math score']
none_mean = prep_means.loc['none', 'math score']

percentage_improvement = ((completed_mean - none_mean) / none_mean) * 100
percentage_improvement

8.766908275212662

In [25]:
# For each parental education level:
# Compute the mean total score
# (total = math + reading + writing).

# Then return only the groups whose mean total score is ≥ 220.

In [26]:
df['total'] = df['math score'] + df['reading score'] + df['writing score']

parent_total = df.groupby('parental level of education')['total'].mean()

parent_total_filtered = parent_total[parent_total >= 220]
parent_total_filtered

parental level of education
master's degree    220.79661
Name: total, dtype: float64